--[[========================== CYPHERS ==========================--

  The following table is how custom "fonts" are loaded into NoxChat's send handler.
  There are no actual fonts, you just have a list of characters and their replacements.
  Essentially, it is a dictionary.
  The code will check each letter in the message you send, and if it is in the cypher table,
  it will replace it with the cypher letter.
  This makes it appear as the sent character FOR EVERYONE.
  Not just NoxChat users.
  This can be both a good thing and a bad thing.
  Since Figura modifies chat messages on the client end,
  these messages and their contents can be reported. Neither Figura nor I will take
  responsibility if a NoxChat message gets reported.

  TO USE:
   - Decide on a symbol(s) to use before a set of () as "font brackets". Example, "cyph:" would end up "cyph:(nameofcypher)"
   - Use empty brackets in-game to clear the cypher. Example, "cyph:()"
   - Name your cypher, and set it = to a table {}. The name will be used in the font brackets
   - In the cypher table {}, set a sequence of symbols equal to their replacement. Recommended format is ["a"] = "letter to replace a"
   - Ensure that there are commas between each value

=================================================================]]

local CYPHERS = {
  
  sc = {
    a="ᴀ",b="ʙ",d="ᴅ",e="ᴇ",f="ғ",
    g="ɢ",h="ʜ",i="ɪ",j="ᴊ",k="ᴋ",l="ʟ",
    m="ᴍ",n="ɴ",p="ᴘ",q="ǫ",r="ʀ",
    t="ᴛ",u="ᴜ",v="ᴠ",w="ᴡ",y="ʏ"
  },
  ups = {
    A="∀",B="ꓭ",C="Ͻ",D="ᗡ",E="Ǝ",F="ᖵ",G="⅁",
    J="ᒋ",K="ꓘ",L="⅂",M="ꟽ",
    P="Ԁ",Q="Ꝺ",R="ꓤ",T="ꓕ",U="Ո",
    V="Ʌ",W="Ϻ",Y="⅄",
    a="ɐ",b="q",c="ɔ",d="p",e="ǝ",f="ⅎ",g="ƃ",
    h="ɥ",i="ᴉ",j="ɾ",k="ʞ",l="ʅ",m="ɯ",n="u",
    p="d",q="b",r="ɹ",t="ʇ",u="n",
    v="ʌ",w="ʍ",y="ʎ",
    ["1"]="⇂",["2"]="↊",["3"]="↋",["4"]="ߤ",
    ["6"]="9",["7"]="𝘓",["9"]="6",
  },
  olde = {
    A="𝔄",B="𝔅",C="ℭ",D="𝔇",E="𝔈",F="𝔉",G="𝔊",
    H="ℌ",I="ℑ",J="𝔍",K="𝔎",L="𝔏",M="𝔐",N="𝔑",
    O="𝔒",P="𝔓",Q="𝔔",R="ℜ",S="𝔖",T="𝔗",U="𝔘",
    V="𝔙",W="𝔚",X="𝔛",Y="𝔜",Z="ℨ",
    a="𝔞",b="𝔟",c="𝔠",d="𝔡",e="𝔢",f="𝔣",g="𝔤",
    h="𝔥",i="𝔦",j="𝔧",k="𝔨",l="𝔩",m="𝔪",n="𝔫",
    o="𝔬",p="𝔭",q="𝔮",r="𝔯",s="𝔰",t="𝔱",u="𝔲",
    v="𝔳",w="𝔴",x="𝔵",y="𝔶",z="𝔷",
  },
  mono = {
    A="𝙰",B="𝙱",C="𝙲",D="𝙳",E="𝙴",F="𝙵",G="𝙶",
    H="𝙷",I="𝙸",J="𝙹",K="𝙺",L="𝙻",M="𝙼",N="𝙽",
    O="𝙾",P="𝙿",Q="𝚀",R="𝚁",S="𝚂",T="𝚃",U="𝚄",
    V="𝚅",W="𝚆",X="𝚇",Y="𝚈",Z="𝚉",
    a="𝚊",b="𝚋",c="𝚌",d="𝚍",e="𝚎",f="𝚏",g="𝚐",
    h="𝚑",i="𝚒",j="𝚓",k="𝚔",l="𝚕",m="𝚖",n="𝚗",
    o="𝚘",p="𝚙",q="𝚚",r="𝚛",s="𝚜",t="𝚝",u="𝚞",
    v="𝚟",w="𝚠",x="𝚡",y="𝚢",z="𝚣",
    ["0"]="𝟶",["1"]="𝟷",["2"]="𝟸",["3"]="𝟹",["4"]="𝟺",
    ["5"]="𝟻",["6"]="𝟼",["7"]="𝟽",["8"]="𝟾",["9"]="𝟿",
  },
  wide = {
    A="Ａ",B="Ｂ",C="Ｃ",D="Ｄ",E="Ｅ",F="Ｆ",G="Ｇ",
    H="Ｈ",I="Ｉ",J="Ｊ",K="Ｋ",L="Ｌ",M="Ｍ",N="Ｎ",
    O="Ｏ",P="Ｐ",Q="Ｑ",R="Ｒ",S="Ｓ",T="Ｔ",U="Ｕ",
    V="Ｖ",W="Ｗ",X="Ｘ",Y="Ｙ",Z="Ｚ",
    a="ａ",b="ｂ",c="ｃ",d="ｄ",e="ｅ",f="ｆ",g="ｇ",
    h="ｈ",i="ｉ",j="ｊ",k="ｋ",l="ｌ",m="ｍ",n="ｎ",
    o="ｏ",p="ｐ",q="ｑ",r="ｒ",s="ｓ",t="ｔ",u="ｕ",
    v="ｖ",w="ｗ",x="ｘ",y="ｙ",z="ｚ",
    ["0"]="０",["1"]="１",["2"]="２",["3"]="３",["4"]="４",
    ["5"]="５",["6"]="６",["7"]="７",["8"]="８",["9"]="９",
  },
  san = {
    A="𝖠",B="𝖡",C="𝖢",D="𝖣",E="𝖤",F="𝖥",G="𝖦",
    H="𝖧",I="𝖨",J="𝖩",K="𝖪",L="𝖫",M="𝖬",N="𝖭",
    O="𝖮",P="𝖯",Q="𝖰",R="𝖱",S="𝖲",T="𝖳",U="𝖴",
    V="𝖵",W="𝖶",X="𝖷",Y="𝖸",Z="𝖹",
    a="𝖺",b="𝖻",c="𝖼",d="𝖽",e="𝖾",f="𝖿",g="𝗀",
    h="𝗁",i="𝗂",j="𝗃",k="𝗄",l="𝗅",m="𝗆",n="𝗇",
    o="𝗈",p="𝗉",q="𝗊",r="𝗋",s="𝗌",t="𝗍",u="𝗎",
    v="𝗏",w="𝗐",x="𝗑",y="𝗒",z="𝗓",
    ["0"]="𝟢",["1"]="𝟣",["2"]="𝟤",["3"]="𝟥",["4"]="𝟦",
    ["5"]="𝟧",["6"]="𝟨",["7"]="𝟩",["8"]="𝟪",["9"]="𝟫",
  },
  serif = {
    A="𝐀",B="𝐁",C="𝐂",D="𝐃",E="𝐄",F="𝐅",G="𝐆",
    H="𝐇",I="𝐈",J="𝐉",K="𝐊",L="𝐋",M="𝐌",N="𝐍",
    O="𝐎",P="𝐏",Q="𝐐",R="𝐑",S="𝐒",T="𝐓",U="𝐔",
    V="𝐕",W="𝐖",X="𝐗",Y="𝐘",Z="𝐙",
    a="𝐚",b="𝐛",c="𝐜",d="𝐝",e="𝐞",f="𝐟",g="𝐠",
    h="𝐡",i="𝐢",j="𝐣",k="𝐤",l="𝐥",m="𝐦",n="𝐧",
    o="𝐨",p="𝐩",q="𝐪",r="𝐫",s="𝐬",t="𝐭",u="𝐮",
    v="𝐯",w="𝐰",x="𝐱",y="𝐲",z="𝐳",
    ["0"]="𝟎",["1"]="𝟏",["2"]="𝟐",["3"]="𝟑",["4"]="𝟒",
    ["5"]="𝟓",["6"]="𝟔",["7"]="𝟕",["8"]="𝟖",["9"]="𝟗",
  },
  csv = {
    A="𝒜",B="ℬ",C="𝒞",D="𝒟",E="ℰ",F="ℱ",G="𝒢",
    H="ℋ",I="ℐ",J="𝒥",K="𝒦",L="ℒ",M="ℳ",N="𝒩",
    O="𝒪",P="𝒫",Q="𝒬",R="ℛ",S="𝒮",T="𝒯",U="𝒰",
    V="𝒱",W="𝒲",X="𝒳",Y="𝒴",Z="𝒵",
    a="𝒶",b="𝒷",c="𝒸",d="𝒹",e="ℯ",f="𝒻",g="ℊ",
    h="𝒽",i="𝒾",j="𝒿",k="𝓀",l="𝓁",m="𝓂",n="𝓃",
    o="ℴ",p="𝓅",q="𝓆",r="𝓇",s="𝓈",t="𝓉",u="𝓊",
    v="𝓋",w="𝓌",x="𝓍",y="𝓎",z="𝓏",
  },
  dbl = {
    A="𝔸",B="𝔹",C="ℂ",D="𝔻",E="𝔼",F="𝔽",G="𝔾",
    H="ℍ",I="𝕀",J="𝕁",K="𝕂",L="𝕃",M="𝕄",N="ℕ",
    O="𝕆",P="ℙ",Q="ℚ",R="ℝ",S="𝕊",T="𝕋",U="𝕌",
    V="𝕍",W="𝕎",X="𝕏",Y="𝕐",Z="ℤ",
    a="𝕒",b="𝕓",c="𝕔",d="𝕕",e="𝕖",f="𝕗",g="𝕘",
    h="𝕙",i="𝕚",j="𝕛",k="𝕜",l="𝕝",m="𝕞",n="𝕟",
    o="𝕠",p="𝕡",q="𝕢",r="𝕣",s="𝕤",t="𝕥",u="𝕦",
    v="𝕧",w="𝕨",x="𝕩",y="𝕪",z="𝕫",
    ["0"]="𝟘",["1"]="𝟙",["2"]="𝟚",["3"]="𝟛",["4"]="𝟜",
    ["5"]="𝟝",["6"]="𝟞",["7"]="𝟟",["8"]="𝟠",["9"]="𝟡",
  },
  bin = { -- this is really just an example of how to format numbers and symbols
    ["2"]="10 ",["3"]="11 ",["4"]="100 ",
    ["5"]="101 ",["6"]="110 ",["7"]="111 ",["8"]="1000 ",["9"]="1001 ",
  },
  sga = {
    A="ᔑ",B="ʖ",C="ᓵ",D="↸",E="ᒷ",F="⎓",G="⊣",
    H="⍑",I="╎",J="⋮",K="ꖌ",L="ꖎ",M="ᒲ",N="リ",
    O="𝙹",P="!¡",Q="ᑑ",R="∷",S="ᓭ",T="ℸ\\u0323",U="⚍",
    V="⍊",W="∴",X="̇/",Y="\\|\\|",Z="⨅",
    a="ᔑ",b="ʖ",c="ᓵ",d="↸",e="ᒷ",f="⎓",g="⊣",
    h="⍑",i="╎",j="⋮",k="ꖌ",l="ꖎ",m="ᒲ",n="リ",
    o="𝙹",p="!¡",q="ᑑ",r="∷",s="ᓭ",t="ℸ\\u0323",u="⚍",
    v="⍊",w="∴",x="̇/",y="\\|\\|",z="⨅",
  },
  nor = {
    A="ᚨ",B="ᛒ",C="ᚲ",D="ᛞ",E="ᛖ",F="ᚠ",G="ᚷ",
    H="ᚺ",I="ᛁ",J="ᛃ",K="ᚴ",L="ᛚ",M="ᛗ",N="ᚾ",
    O="ᛟ",P="ᛈ",Q="ᚳ",R="ᚱ",S="ᛋ",T="ᛏ",U="ᚢ",
    V="ᛢ",W="ᚹ",X="ᚪ",Y="ᛇ",Z="ᛉ",  ["="]="ᚦ", --th
    a="ᚨ",b="ᛒ",c="ᚲ",d="ᛞ",e="ᛖ",f="ᚠ",g="ᚷ",
    h="ᚺ",i="ᛁ",j="ᛃ",k="ᚴ",l="ᛚ",m="ᛗ",n="ᚾ",
    o="ᛟ",p="ᛈ",q="ᚳ",r="ᚱ",s="ᛋ",t="ᛏ",u="ᚢ",
    v="ᛢ",w="ᚹ",x="ᚪ",y="ᛇ",z="ᛉ",  ["-"]="ᛝ", --ng
    ["+"]="ᛣ", --ch
  },

}
return CYPHERS